jonahn/EE478/Lab2/PIC_SOURCES/h/p18f86j99.h
#pragma varlocate 13 UEP0
#pragma varlocate 13 UEP0bits
#pragma varlocate 14 UEP1
#pragma varlocate 14 UEP1bits
#pragma varlocate 14 UEP2
#pragma varlocate 14 UEP2bits
#pragma varlocate 14 UEP3
#pragma varlocate 14 UEP3bits
#pragma varlocate 14 UEP4
#pragma varlocate 14 UEP4bits
#pragma varlocate 14 UEP5
#pragma varlocate 14 UEP5bits
#pragma varlocate 14 UEP6
#pragma varlocate 14 UEP6bits
#pragma varlocate 14 UEP7
#pragma varlocate 14 UEP7bits
#pragma varlocate 14 UEP8
#pragma varlocate 14 UEP8bits
#pragma varlocate 14 UEP9
#pragma varlocate 14 UEP9bits
#pragma varlocate 14 UEP10
#pragma varlocate 14 UEP10bits
#pragma varlocate 14 UEP11
#pragma varlocate 14 UEP11bits
#pragma varlocate 14 UEP12
#pragma varlocate 14 UEP12bits
#pragma varlocate 14 UEP13
#pragma varlocate 14 UEP13bits
#pragma varlocate 14 UEP14
#pragma varlocate 14 UEP14bits
#pragma varlocate 14 UEP15
#pragma varlocate 14 UEP15bits
#pragma varlocate 14 UEIE
#pragma varlocate 14 UEIEbits
#pragma varlocate 14 UIE
#pragma varlocate 14 UIEbits
#pragma varlocate 14 UCFG
#pragma varlocate 14 UCFGbits
#pragma varlocate 14 RPOR0_1
#pragma varlocate 14 RPOR0_1bits
#pragma varlocate 14 RPOR2_3
#pragma varlocate 14 RPOR2_3bits
#pragma varlocate 14 RPOR4_5
#pragma varlocate 14 RPOR4_5bits
#pragma varlocate 14 RPOR6_7
#pragma varlocate 14 RPOR6_7bits
#pragma varlocate 14 RPOR8_9
#pragma varlocate 14 RPOR8_9bits
#pragma varlocate 14 RPOR10_11
#pragma varlocate 14 RPOR10_11bits
#pragma varlocate 14 RPOR12_13
#pragma varlocate 14 RPOR12_13bits
#pragma varlocate 14 RPOR14_15
#pragma varlocate 14 RPOR14_15bits
#pragma varlocate 14 RPOR16_17
#pragma varlocate 14 RPOR16_17bits
#pragma varlocate 14 RPOR18_19
#pragma varlocate 14 RPOR18_19bits
#pragma varlocate 14 RPOR20_21
#pragma varlocate 14 RPOR20_21bits
#pragma varlocate 14 RPOR22_23
#pragma varlocate 14 RPOR22_23bits
#pragma varlocate 14 RPOR24_25
#pragma varlocate 14 RPOR24_25bits
#pragma varlocate 14 RPOR26_27
#pragma varlocate 14 RPOR26_27bits
#pragma varlocate 14 RPOR28_29
#pragma varlocate 14 RPOR28_29bits
#pragma varlocate 14 RPOR30_31
#pragma varlocate 14 RPOR30_31bits
#pragma varlocate 14 RPOR32_33
#pragma varlocate 14 RPOR32_33bits
#pragma varlocate 14 RPOR34_35
#pragma varlocate 14 RPOR34_35bits
#pragma varlocate 14 RPOR36_37
#pragma varlocate 14 RPOR36_37bits
#pragma varlocate 14 RPOR38_39
#pragma varlocate 14 RPOR38_39bits
#pragma varlocate 14 RPOR40_41
#pragma varlocate 14 RPOR40_41bits
#pragma varlocate 14 RPOR42_43
#pragma varlocate 14 RPOR42_43bits
#pragma varlocate 14 RPOR44_45
#pragma varlocate 14 RPOR44_45bits
#pragma varlocate 14 RPOR46
#pragma varlocate 14 RPOR46bits
#pragma varlocate 14 RPINR0_1
#pragma varlocate 14 RPINR0_1bits
#pragma varlocate 14 RPINR2_3
#pragma varlocate 14 RPINR2_3bits
#pragma varlocate 14 RPINR4_5
#pragma varlocate 14 RPINR4_5bits
#pragma varlocate 14 RPINR6_7
#pragma varlocate 14 RPINR6_7bits
#pragma varlocate 14 RPINR8_9
#pragma varlocate 14 RPINR8_9bits
#pragma varlocate 14 RPINR10_11
#pragma varlocate 14 RPINR10_11bits
#pragma varlocate 14 RPINR12_13
#pragma varlocate 14 RPINR12_13bits
#pragma varlocate 14 RPINR14_15
#pragma varlocate 14 RPINR14_15bits
#pragma varlocate 14 RPINR16_17
#pragma varlocate 14 RPINR16_17bits
#pragma varlocate 14 RPINR18_19
#pragma varlocate 14 RPINR18_19bits
#pragma varlocate 14 RPINR20_21
#pragma varlocate 14 RPINR20_21bits
#pragma varlocate 14 RPINR22_23
#pragma varlocate 14 RPINR22_23bits
#pragma varlocate 14 RPINR24_25
#pragma varlocate 14 RPINR24_25bits
#pragma varlocate 14 RPINR26_27
#pragma varlocate 14 RPINR26_27bits
#pragma varlocate 14 RPINR28_29
#pragma varlocate 14 RPINR28_29bits
#pragma varlocate 14 RPINR30_31
#pragma varlocate 14 RPINR30_31bits
#pragma varlocate 14 RPINR32_33
#pragma varlocate 14 RPINR32_33bits
#pragma varlocate 14 RPINR34_35
#pragma varlocate 14 RPINR34_35bits
#pragma varlocate 14 RPINR36_37
#pragma varlocate 14 RPINR36_37bits
#pragma varlocate 14 RPINR38_39
#pragma varlocate 14 RPINR38_39bits
#pragma varlocate 14 RPINR40_41
#pragma varlocate 14 RPINR40_41bits
#pragma varlocate 14 RPINR42_43
#pragma varlocate 14 RPINR42_43bits
#pragma varlocate 14 RPINR44_45
#pragma varlocate 14 RPINR44_45bits
#pragma varlocate 14 RPINR46_47
#pragma varlocate 14 RPINR46_47bits
#pragma varlocate 14 RPINR48_49
#pragma varlocate 14 RPINR48_49bits
#pragma varlocate 14 RPINR50_51
#pragma varlocate 14 RPINR50_51bits
#pragma varlocate 14 RPINR52_53
#pragma varlocate 14 RPINR52_53bits
#pragma varlocate 14 ANCON3
#pragma varlocate 14 ANCON3bits
#pragma varlocate 14 ANCON2
#pragma varlocate 14 ANCON2bits
#pragma varlocate 14 ANCON1
#pragma varlocate 14 ANCON1bits
#pragma varlocate 14 ADCBUF1
#pragma varlocate 14 ADCBUF1L
#pragma varlocate 14 ADCBUF1H
#pragma varlocate 14 ADCBUF2
#pragma varlocate 14 ADCBUF2L
#pragma varlocate 14 ADCBUF2H
#pragma varlocate 14 ADCBUF3
#pragma varlocate 14 ADCBUF3L
#pragma varlocate 14 ADCBUF3H
#pragma varlocate 14 ADCBUF4
#pragma varlocate 14 ADCBUF4L
#pragma varlocate 14 ADCBUF4H
#pragma varlocate 14 ADCBUF5
#pragma varlocate 14 ADCBUF5L
#pragma varlocate 14 ADCBUF5H
#pragma varlocate 14 ADCBUF6
#pragma varlocate 14 ADCBUF6L
#pragma varlocate 14 ADCBUF6H
#pragma varlocate 14 ADCBUF7
#pragma varlocate 14 ADCBUF7L
#pragma varlocate 14 ADCBUF7H
#pragma varlocate 14 ADCBUF8
#pragma varlocate 14 ADCBUF8L
#pragma varlocate 14 ADCBUF8H
#pragma varlocate 14 ADCBUF9
#pragma varlocate 14 ADCBUF9L
#pragma varlocate 14 ADCBUF9H
#pragma varlocate 14 ADCBUF10
#pragma varlocate 14 ADCBUF10L
#pragma varlocate 14 ADCBUF10H
#pragma varlocate 14 ADCBUF11
#pragma varlocate 14 ADCBUF11L
#pragma varlocate 14 ADCBUF11H
#pragma varlocate 14 ADCBUF12
#pragma varlocate 14 ADCBUF12L
#pragma varlocate 14 ADCBUF12H
#pragma varlocate 14 ADCBUF13
#pragma varlocate 14 ADCBUF13L
#pragma varlocate 14 ADCBUF13H
#pragma varlocate 14 ADCBUF14
#pragma varlocate 14 ADCBUF14L
#pragma varlocate 14 ADCBUF14H
#pragma varlocate 14 ADCBUF15
#pragma varlocate 14 ADCBUF15L
#pragma varlocate 14 ADCBUF15H
#pragma varlocate 14 ADCBUF16
#pragma varlocate 14 ADCBUF16L
#pragma varlocate 14 ADCBUF16H
#pragma varlocate 14 ADCBUF17
#pragma varlocate 14 ADCBUF17L
#pragma varlocate 14 ADCBUF17H
#pragma varlocate 14 ADCBUF18
#pragma varlocate 14 ADCBUF18L
#pragma varlocate 14 ADCBUF18H
#pragma varlocate 14 ADCBUF19
#pragma varlocate 14 ADCBUF19L
#pragma varlocate 14 ADCBUF19H
#pragma varlocate 14 ADCBUF20
#pragma varlocate 14 ADCBUF20L
#pragma varlocate 14 ADCBUF20H
#pragma varlocate 14 ADCBUF21
#pragma varlocate 14 ADCBUF21L
#pragma varlocate 14 ADCBUF21H
#pragma varlocate 14 ADCBUF22
#pragma varlocate 14 ADCBUF22L
#pragma varlocate 14 ADCBUF22H
#pragma varlocate 14 ADCBUF23
#pragma varlocate 14 ADCBUF23L
#pragma varlocate 14 ADCBUF23H
#pragma varlocate 14 ADCBUF24
#pragma varlocate 14 ADCBUF24L
#pragma varlocate 14 ADCBUF24H
#pragma varlocate 14 ADCBUF25
#pragma varlocate 14 ADCBUF25L
#pragma varlocate 14 ADCBUF25H
#pragma varlocate 14 ADCTMUEN0L
#pragma varlocate 14 ADCTMUEN0Lbits
#pragma varlocate 14 ADCTMUEN0H
#pragma varlocate 14 ADCTMUEN0Hbits
#pragma varlocate 14 ADCTMUEN1L
#pragma varlocate 14 ADCTMUEN1Lbits
#pragma varlocate 14 ADCTMUEN1H
#pragma varlocate 14 ADCTMUEN1Hbits
#pragma varlocate 14 ADCHIT0L
#pragma varlocate 14 ADCHIT0Lbits
#pragma varlocate 14 ADCHIT0H
#pragma varlocate 14 ADCHIT0Hbits
#pragma varlocate 14 ADCHIT1L
#pragma varlocate 14 ADCHIT1Lbits
#pragma varlocate 14 ADCHIT1H
#pragma varlocate 14 ADCHIT1Hbits
#pragma varlocate 14 ADCSS0L
#pragma varlocate 14 ADCSS0Lbits
#pragma varlocate 14 ADCSS0H
#pragma varlocate 14 ADCSS0Hbits
#pragma varlocate 14 ADCSS1L
#pragma varlocate 14 ADCSS1Lbits
#pragma varlocate 14 ADCSS1H
#pragma varlocate 14 ADCSS1Hbits
#pragma varlocate 14 ADCHS0L
#pragma varlocate 14 ADCHS0Lbits
#pragma varlocate 14 ADCHS0H
#pragma varlocate 14 ADCHS0Hbits
#pragma varlocate 14 ADCON5L
#pragma varlocate 14 ADCON5Lbits
#pragma varlocate 14 ADCON5H
#pragma varlocate 14 ADCON5Hbits
#pragma varlocate 14 ADCON3L
#pragma varlocate 14 ADCON3Lbits
#pragma varlocate 14 ADCON3H
#pragma varlocate 14 ADCON3Hbits
#pragma varlocate 14 ADCON2L
#pragma varlocate 14 ADCON2Lbits
#pragma varlocate 14 ADCON2H
#pragma varlocate 14 ADCON2Hbits
#pragma varlocate 14 LCDDATA0
#pragma varlocate 14 LCDDATA0bits
#pragma varlocate 14 LCDDATA1
#pragma varlocate 14 LCDDATA1bits
#pragma varlocate 14 LCDDATA2
#pragma varlocate 14 LCDDATA2bits
#pragma varlocate 14 LCDDATA3
#pragma varlocate 14 LCDDATA3bits
#pragma varlocate 14 LCDDATA4
#pragma varlocate 14 LCDDATA4bits
#pragma varlocate 14 LCDDATA5
#pragma varlocate 14 LCDDATA5bits
#pragma varlocate 14 LCDDATA6
#pragma varlocate 14 LCDDATA6bits
#pragma varlocate 14 LCDDATA7
#pragma varlocate 14 LCDDATA7bits
#pragma varlocate 14 LCDDATA8
#pragma varlocate 14 LCDDATA8bits
#pragma varlocate 14 LCDDATA9
#pragma varlocate 14 LCDDATA9bits
#pragma varlocate 14 LCDDATA10
#pragma varlocate 14 LCDDATA10bits
#pragma varlocate 14 LCDDATA11
#pragma varlocate 14 LCDDATA11bits
#pragma varlocate 14 LCDDATA12
#pragma varlocate 14 LCDDATA12bits
#pragma varlocate 14 LCDDATA13
#pragma varlocate 14 LCDDATA13bits
#pragma varlocate 14 LCDDATA14
#pragma varlocate 14 LCDDATA14bits
#pragma varlocate 14 LCDDATA15
#pragma varlocate 14 LCDDATA15bits
#pragma varlocate 14 LCDDATA16
#pragma varlocate 14 LCDDATA16bits
#pragma varlocate 14 LCDDATA17
#pragma varlocate 14 LCDDATA17bits
#pragma varlocate 14 LCDDATA18
#pragma varlocate 14 LCDDATA18bits
#pragma varlocate 14 LCDDATA19
#pragma varlocate 14 LCDDATA19bits
#pragma varlocate 14 LCDDATA20
#pragma varlocate 14 LCDDATA20bits
#pragma varlocate 14 LCDDATA21
#pragma varlocate 14 LCDDATA21bits
#pragma varlocate 14 LCDDATA22
#pragma varlocate 14 LCDDATA22bits
#pragma varlocate 14 LCDDATA23
#pragma varlocate 14 LCDDATA23bits
#pragma varlocate 14 LCDDATA24
#pragma varlocate 14 LCDDATA24bits
#pragma varlocate 14 LCDDATA25
#pragma varlocate 14 LCDDATA25bits
#pragma varlocate 14 LCDDATA26
#pragma varlocate 14 LCDDATA26bits
#pragma varlocate 14 LCDDATA27
#pragma varlocate 14 LCDDATA27bits
#pragma varlocate 14 LCDDATA28
#pragma varlocate 14 LCDDATA28bits
#pragma varlocate 14 LCDDATA29
#pragma varlocate 14 LCDDATA29bits
#pragma varlocate 14 LCDDATA30
#pragma varlocate 14 LCDDATA30bits
#pragma varlocate 14 LCDDATA31
#pragma varlocate 14 LCDDATA31bits
#pragma varlocate 14 LCDDATA32
#pragma varlocate 14 LCDDATA32bits
#pragma varlocate 14 LCDDATA33
#pragma varlocate 14 LCDDATA33bits
#pragma varlocate 14 LCDDATA34
#pragma varlocate 14 LCDDATA34bits
#pragma varlocate 14 LCDDATA35
#pragma varlocate 14 LCDDATA35bits
#pragma varlocate 14 LCDDATA36
#pragma varlocate 14 LCDDATA36bits
#pragma varlocate 14 LCDDATA37
#pragma varlocate 14 LCDDATA37bits
#pragma varlocate 14 LCDDATA38
#pragma varlocate 14 LCDDATA38bits
#pragma varlocate 14 LCDDATA39
#pragma varlocate 14 LCDDATA39bits
#pragma varlocate 14 LCDDATA40
#pragma varlocate 14 LCDDATA40bits
#pragma varlocate 14 LCDDATA41
#pragma varlocate 14 LCDDATA41bits
#pragma varlocate 14 LCDDATA42
#pragma varlocate 14 LCDDATA42bits
#pragma varlocate 14 LCDDATA43
#pragma varlocate 14 LCDDATA43bits
#pragma varlocate 14 LCDDATA44
#pragma varlocate 14 LCDDATA44bits
#pragma varlocate 14 LCDDATA45
#pragma varlocate 14 LCDDATA45bits
#pragma varlocate 14 LCDDATA46
#pragma varlocate 14 LCDDATA46bits
#pragma varlocate 14 LCDDATA47
#pragma varlocate 14 LCDDATA47bits
#pragma varlocate 14 LCDDATA48
#pragma varlocate 14 LCDDATA48bits
#pragma varlocate 14 LCDDATA49
#pragma varlocate 14 LCDDATA49bits
#pragma varlocate 14 LCDDATA50
#pragma varlocate 14 LCDDATA50bits
#pragma varlocate 14 LCDDATA51
#pragma varlocate 14 LCDDATA51bits
#pragma varlocate 14 LCDDATA52
#pragma varlocate 14 LCDDATA52bits
#pragma varlocate 14 LCDDATA53
#pragma varlocate 14 LCDDATA53bits
#pragma varlocate 14 LCDDATA54
#pragma varlocate 14 LCDDATA54bits
#pragma varlocate 14 LCDDATA55
#pragma varlocate 14 LCDDATA55bits
#pragma varlocate 14 LCDDATA56
#pragma varlocate 14 LCDDATA56bits
#pragma varlocate 14 LCDDATA57
#pragma varlocate 14 LCDDATA57bits
#pragma varlocate 14 LCDDATA58
#pragma varlocate 14 LCDDATA58bits
#pragma varlocate 14 LCDDATA59
#pragma varlocate 14 LCDDATA59bits
#pragma varlocate 14 LCDDATA60
#pragma varlocate 14 LCDDATA60bits
#pragma varlocate 14 LCDDATA61
#pragma varlocate 14 LCDDATA61bits
#pragma varlocate 14 LCDDATA62
#pragma varlocate 14 LCDDATA62bits
#pragma varlocate 14 LCDDATA63
#pragma varlocate 14 LCDDATA63bits
#pragma varlocate 14 LCDSE0
#pragma varlocate 14 LCDSE0bits
#pragma varlocate 14 LCDSE1
#pragma varlocate 14 LCDSE1bits
#pragma varlocate 14 LCDSE2
#pragma varlocate 14 LCDSE2bits
#pragma varlocate 14 LCDSE3
#pragma varlocate 14 LCDSE3bits
#pragma varlocate 14 LCDSE4
#pragma varlocate 14 LCDSE4bits
#pragma varlocate 14 LCDSE5
#pragma varlocate 14 LCDSE5bits
#pragma varlocate 14 LCDSE6
#pragma varlocate 14 LCDSE6bits
#pragma varlocate 14 LCDSE7
#pragma varlocate 14 LCDSE7bits
#pragma varlocate 14 LCDRL
#pragma varlocate 14 LCDRLbits
#pragma varlocate 14 LCDREF
#pragma varlocate 14 LCDREFbits
#pragma varlocate 14 LCDREG
#pragma varlocate 14 LCDREGbits
#pragma varlocate 14 LCDCON
#pragma varlocate 14 LCDCONbits
#pragma varlocate 14 LCDPS
#pragma varlocate 14 LCDPSbits
#pragma varlocate 14 REFO2CON3
#pragma varlocate 14 REFO2CON3bits
#pragma varlocate 14 REFO2CON2
#pragma varlocate 14 REFO2CON2bits
#pragma varlocate 14 REFO2CON1
#pragma varlocate 14 REFO2CON1bits
#pragma varlocate 14 REFO2CON
#pragma varlocate 14 REFO2CONbits
#pragma varlocate 14 REFO1CON3
#pragma varlocate 14 REFO1CON3bits
#pragma varlocate 14 REFO1CON2
#pragma varlocate 14 REFO1CON2bits
#pragma varlocate 14 REFO1CON1
#pragma varlocate 14 REFO1CON1bits
#pragma varlocate 14 REFO1CON
#pragma varlocate 14 REFO1CONbits
#pragma varlocate 14 MEMCON
#pragma varlocate 14 MEMCONbits
#pragma varlocate 14 ODCON2
#pragma varlocate 14 ODCON2bits
#pragma varlocate 14 ODCON1
#pragma varlocate 14 ODCON1bits
#pragma varlocate 14 MDCARL
#pragma varlocate 14 MDCARLbits
#pragma varlocate 14 MDCARH
#pragma varlocate 14 MDCARHbits
#pragma varlocate 14 MDSRC
#pragma varlocate 14 MDSRCbits
#pragma varlocate 14 MDCON
#pragma varlocate 14 MDCONbits
#pragma varlocate 14 PMD4
#pragma varlocate 14 PMD4bits
#pragma varlocate 14 PMD3
#pragma varlocate 14 PMD3bits
#pragma varlocate 14 PMD2
#pragma varlocate 14 PMD2bits
#pragma varlocate 14 PMD1
#pragma varlocate 14 PMD1bits
#pragma varlocate 14 PMD0
#pragma varlocate 14 PMD0bits
#pragma varlocate 14 CTMUCON4
#pragma varlocate 14 CTMUCON4bits
#pragma varlocate 14 CTMUCON3
#pragma varlocate 14 CTMUCON3bits
#pragma varlocate 14 CTMUCON2
#pragma varlocate 14 CTMUCON2bits
#pragma varlocate 14 CTMUCON1
#pragma varlocate 14 CTMUCON1bits
#pragma varlocate 14 TXREG4
#pragma varlocate 14 RCREG4
#pragma varlocate 14 SPBRG4
#pragma varlocate 14 SPBRG4bits
#pragma varlocate 14 SPBRGH4
#pragma varlocate 14 SPBRGH4bits
#pragma varlocate 14 BAUDCON4
#pragma varlocate 14 BAUDCON4bits
#pragma varlocate 14 TXSTA4
#pragma varlocate 14 TXSTA4bits
#pragma varlocate 14 RCSTA4
#pragma varlocate 14 RCSTA4bits
#pragma varlocate 15 DMACON2
#pragma varlocate 15 DMACON2bits
#pragma varlocate 15 ANCFG
#pragma varlocate 15 ANCFGbits
#pragma varlocate 15 SSP2ADD
#pragma varlocate 15 SSP2BUF
#pragma varlocate 15 T4CON
#pragma varlocate 15 T4CONbits
#pragma varlocate 15 PR4
#pragma varlocate 15 TMR4
#pragma varlocate 15 CCP7CON
#pragma varlocate 15 CCP7CONbits
#pragma varlocate 15 CCPR7
#pragma varlocate 15 CCPR7L
#pragma varlocate 15 CCPR7H
#pragma varlocate 15 CCP6CON
#pragma varlocate 15 CCP6CONbits
#pragma varlocate 15 CCPR6
#pragma varlocate 15 CCPR6L
#pragma varlocate 15 CCPR6H
#pragma varlocate 15 CCP5CON
#pragma varlocate 15 CCP5CONbits
#pragma varlocate 15 CCPR5
#pragma varlocate 15 CCPR5L
#pragma varlocate 15 CCPR5H
#pragma varlocate 15 CCP4CON
#pragma varlocate 15 CCP4CONbits
#pragma varlocate 15 CCPR4
#pragma varlocate 15 CCPR4L
#pragma varlocate 15 CCPR4H
#pragma varlocate 15 T5GCON
#pragma varlocate 15 T5GCONbits
#pragma varlocate 15 T5CON
#pragma varlocate 15 T5CONbits
#pragma varlocate 15 TMR5L
#pragma varlocate 15 TMR5H
#pragma varlocate 15 SSP2MSK
#pragma varlocate 15 SSP2MSKbits
#pragma varlocate 15 SSP2CON2
#pragma varlocate 15 SSP2CON2bits
#pragma varlocate 15 SSP2CON1
#pragma varlocate 15 SSP2CON1bits
#pragma varlocate 15 SSP2STAT
#pragma varlocate 15 SSP2STATbits
#pragma varlocate 15 PSTR3CON
#pragma varlocate 15 PSTR3CONbits
#pragma varlocate 15 PSTR2CON
#pragma varlocate 15 PSTR2CONbits
#pragma varlocate 15 TXREG2
#pragma varlocate 15 RCREG2
#pragma varlocate 15 SPBRG2
#pragma varlocate 15 SPBRG2bits
#pragma varlocate 15 SPBRGH2
#pragma varlocate 15 SPBRGH2bits
#pragma varlocate 15 DSGPR3
#pragma varlocate 15 DSGPR2
#pragma varlocate 15 DSGPR1
#pragma varlocate 15 DSGPR0
#pragma varlocate 15 DSWAKEH
#pragma varlocate 15 DSWAKEHbits
#pragma varlocate 15 DSWAKEL
#pragma varlocate 15 DSWAKELbits
#pragma varlocate 15 DSCONH
#pragma varlocate 15 DSCONHbits
#pragma varlocate 15 DSCONL
#pragma varlocate 15 DSCONLbits
#pragma varlocate 15 TXREG3
#pragma varlocate 15 RCREG3
#pragma varlocate 15 SPBRG3
#pragma varlocate 15 SPBRG3bits
#pragma varlocate 15 SPBRGH3
#pragma varlocate 15 SPBRGH3bits
#pragma varlocate 15 BAUDCON3
#pragma varlocate 15 BAUDCON3bits
#pragma varlocate 15 TXSTA3
#pragma varlocate 15 TXSTA3bits
#pragma varlocate 15 RCSTA3
#pragma varlocate 15 RCSTA3bits
#pragma varlocate 15 SPBRGH
#pragma varlocate 15 SPBRGHbits
#pragma varlocate 15 SPBRGH1
#pragma varlocate 15 SPBRGH1bits
#pragma varlocate 15 BAUDCON2
#pragma varlocate 15 BAUDCON2bits
#pragma varlocate 15 TXSTA2
#pragma varlocate 15 TXSTA2bits
#pragma varlocate 15 RCSTA2
#pragma varlocate 15 RCSTA2bits
#pragma varlocate 15 CCPTMRS2
#pragma varlocate 15 CCPTMRS2bits
#pragma varlocate 15 CCPTMRS1
#pragma varlocate 15 CCPTMRS1bits
#pragma varlocate 15 CCPTMRS0
#pragma varlocate 15 CCPTMRS0bits
#pragma varlocate 15 CM3CON
#pragma varlocate 15 CM3CONbits
#pragma varlocate 15 CM2CON
#pragma varlocate 15 CM2CONbits
#pragma varlocate 15 SSP2CON3
#pragma varlocate 15 SSP2CON3bits
#pragma varlocate 15 T8CON
#pragma varlocate 15 T8CONbits
#pragma varlocate 15 PR8
#pragma varlocate 15 TMR8
#pragma varlocate 15 T6CON
#pragma varlocate 15 T6CONbits
#pragma varlocate 15 PR6
#pragma varlocate 15 TMR6
#pragma varlocate 15 CCP10CON
#pragma varlocate 15 CCP10CONbits
#pragma varlocate 15 CCPR10
#pragma varlocate 15 CCPR10L
#pragma varlocate 15 CCPR10H
#pragma varlocate 15 CCP9CON
#pragma varlocate 15 CCP9CONbits
#pragma varlocate 15 CCPR9
#pragma varlocate 15 CCPR9L
#pragma varlocate 15 CCPR9H
#pragma varlocate 15 CCP8CON
#pragma varlocate 15 CCP8CONbits
#pragma varlocate 15 CCPR8
#pragma varlocate 15 CCPR8L
#pragma varlocate 15 CCPR8H
#pragma varlocate 15 CCP3CON
#pragma varlocate 15 CCP3CONbits
#pragma varlocate 15 CCPR3
#pragma varlocate 15 CCPR3L
#pragma varlocate 15 CCPR3H
#pragma varlocate 15 ECCP3DEL
#pragma varlocate 15 ECCP3DELbits
#pragma varlocate 15 ECCP3AS
#pragma varlocate 15 ECCP3ASbits
#pragma varlocate 15 CCP2CON
#pragma varlocate 15 CCP2CONbits
#pragma varlocate 15 CCPR2
#pragma varlocate 15 CCPR2L
#pragma varlocate 15 CCPR2H
#pragma varlocate 15 ECCP2DEL
#pragma varlocate 15 ECCP2DELbits
#pragma varlocate 15 ECCP2AS
#pragma varlocate 15 ECCP2ASbits
#pragma varlocate 15 CM1CON
#pragma varlocate 15 CM1CONbits
#pragma varlocate 15 PADCFG1
#pragma varlocate 15 PADCFG1bits
#pragma varlocate 15 IOCN
#pragma varlocate 15 IOCNbits
#pragma varlocate 15 IOCP
#pragma varlocate 15 IOCPbits
#pragma varlocate 15 RTCCON2
#pragma varlocate 15 RTCCON2bits
#pragma varlocate 15 ALRMVALL
#pragma varlocate 15 ALRMVALH
#pragma varlocate 15 ALRMRPT
#pragma varlocate 15 ALRMRPTbits
#pragma varlocate 15 ALRMCFG
#pragma varlocate 15 ALRMCFGbits
#pragma varlocate 15 RTCVALL
#pragma varlocate 15 RTCVALH
#pragma varlocate 15 RTCCAL
#pragma varlocate 15 RTCCALbits
#pragma varlocate 15 RTCCON1
#pragma varlocate 15 RTCCON1bits

/*-------------------------------------------------------------------------
 * Some useful defines for inline assembly stuff
 *-------------------------------------------------------------------------*/
#define ACCESS 0
#define BANKED 1

/*-------------------------------------------------------------------------
 * Some useful macros for inline assembly stuff
 *-------------------------------------------------------------------------*/
#define Nop()    {_asm nop _endasm}
#define ClrWdt() {_asm clrwdt _endasm}
#define Sleep()  {_asm sleep _endasm}
#define Reset()  {_asm reset _endasm}

#define Rlcf(f,dest,access)  {_asm movlb f rlcf f,dest,access _endasm}
#define Rlncf(f,dest,access) {_asm movlb f rlncf f,dest,access _endasm}
#define Rrcf(f,dest,access)  {_asm movlb f rrcf f,dest,access _endasm}
#define Rrncf(f,dest,access) {_asm movlb f rrncf f,dest,access _endasm}
#define Swapf(f,dest,access) {_asm movlb f swapf f,dest,access _endasm }

/*-------------------------------------------------------------------------
 * A fairly inclusive set of registers to save for interrupts.
 * These are locations which are commonly used by the compiler.
 *-------------------------------------------------------------------------*/
#define INTSAVELOCS TBLPTR, TABLAT, PROD


#endif
